adjointShapeOptimizationFoam_org/inletoutletsimulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        nFaces          18432;
        startFace       18240;
    }
    leftWall
    {
        type            wall;
        physicalType    wall;
        nFaces          256;
        startFace       36672;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          32;
        startFace       36928;
    }
    rightWall
    {
        type            wall;
        physicalType    wall;
        nFaces          64;
        startFace       36960;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          32;
        startFace       37024;
    }
)

// ************************************************************************* //
